## Plan Result (account-delete-monitor-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/197849)



<pre><code>Plan: 0 to add, 18 to change, 0 to destroy.</code></pre>

* Update
  * aws_cloudwatch_log_group.eventtracker_lambda_log-group_D52B53E0
  * aws_codedeploy_app.eventtracker_lambda-code-deploy_code-deploy-app_B68BD6E0
  * aws_codedeploy_deployment_group.eventtracker_lambda-code-deploy_code-deployment-group_C430DA66
  * aws_dynamodb_table.event-table_dynamodb_table_49BD839C
  * aws_iam_policy.EventTracker-lambda-dynamo-policy
  * aws_iam_policy.eventtracker_lambda_execution-policy_A74ACAF0
  * aws_iam_policy.eventtracker_sqs-policy_32E8FFAA
  * aws_iam_role.eventtracker_lambda-code-deploy_code-deploy-role_761181E3
  * aws_iam_role.eventtracker_lambda_execution-role_6AC27719
  * aws_lambda_function.eventtracker_lambda_2D56166D
  * aws_s3_bucket.eventtracker_lambda_code-bucket_E2F7C311
  * aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
  * aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
  * aws_sqs_queue.eventtracker_lambda_sqs_queue_3DFE90FE
  * aws_sqs_queue.eventtracker_lambda_sqs_queue_redrive_sqs_queue_D13D2A55
  * aws_sqs_queue.sns-topic-dql
  * aws_sqs_queue_policy.adm-sns-dlq-policy
  * aws_sqs_queue_policy.adm-sns-sqs-policy



<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.EventTracker-lambda-dynamo-policy-doc will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "EventTracker-lambda-dynamo-policy-doc" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:us-east-1:996905175585:table/ADM-Prod-event-table",
            ]
        }
    }

  # data.aws_iam_policy_document.adm-sns-dlq-policy-document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "adm-sns-dlq-policy-document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:AccountDeleteMonitor-Prod-SNS-Topics-DLQ",
            ]

          + condition {
              + test     = "ArnLike"
              + values   = [
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserMerge-Topic",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.adm-sns-sqs-policy-document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "adm-sns-sqs-policy-document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:AccountDeleteMonitor-Prod-EventTracker-Queue",
            ]

          + condition {
              + test     = "ArnLike"
              + values   = [
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserMerge-Topic",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.eventtracker_lambda_sqs_policy_DEBDCD47 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "eventtracker_lambda_sqs_policy_DEBDCD47" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:AccountDeleteMonitor-Prod-EventTracker-Queue",
            ]
        }
    }

  # aws_cloudwatch_log_group.eventtracker_lambda_log-group_D52B53E0 will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "eventtracker_lambda_log-group_D52B53E0" {
        id                = "/aws/lambda/AccountDeleteMonitor-Prod-EventTracker-Function"
        name              = "/aws/lambda/AccountDeleteMonitor-Prod-EventTracker-Function"
      ~ tags              = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
            "costCenter"     = "Pocket"
          - "env_code"       = "prod" -> null
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDeleteMonitor"
        }
      ~ tags_all          = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_codedeploy_app.eventtracker_lambda-code-deploy_code-deploy-app_B68BD6E0 will be updated in-place
  ~ resource "aws_codedeploy_app" "eventtracker_lambda-code-deploy_code-deploy-app_B68BD6E0" {
        id                  = "f2e37747-90fd-49c3-9e29-17228b6d477e:AccountDeleteMonitor-Prod-EventTracker-Lambda"
        name                = "AccountDeleteMonitor-Prod-EventTracker-Lambda"
      ~ tags                = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
        }
      ~ tags_all            = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_codedeploy_deployment_group.eventtracker_lambda-code-deploy_code-deployment-group_C430DA66 will be updated in-place
  ~ resource "aws_codedeploy_deployment_group" "eventtracker_lambda-code-deploy_code-deployment-group_C430DA66" {
        id                          = "ad83bedb-b455-45c9-a7c8-6c6cff2bde46"
      ~ tags                        = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
        }
      ~ tags_all                    = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_dynamodb_table.event-table_dynamodb_table_49BD839C will be updated in-place
  ~ resource "aws_dynamodb_table" "event-table_dynamodb_table_49BD839C" {
        id                          = "ADM-Prod-event-table"
        name                        = "ADM-Prod-event-table"
      ~ tags                        = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
            "costCenter"     = "Pocket"
          - "env_code"       = "prod" -> null
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDeleteMonitor"
        }
      ~ tags_all                    = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_iam_policy.EventTracker-lambda-dynamo-policy will be updated in-place
  ~ resource "aws_iam_policy" "EventTracker-lambda-dynamo-policy" {
        id               = "arn:aws:iam::996905175585:policy/account-delete-monitor-EventTracker-DynamoLambdaPolicy"
        name             = "account-delete-monitor-EventTracker-DynamoLambdaPolicy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "dynamodb:*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:us-east-1:996905175585:table/ADM-Prod-event-table"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags             = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
        }
      ~ tags_all         = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_iam_policy.eventtracker_lambda_execution-policy_A74ACAF0 will be updated in-place
  ~ resource "aws_iam_policy" "eventtracker_lambda_execution-policy_A74ACAF0" {
        id               = "arn:aws:iam::996905175585:policy/AccountDeleteMonitor-Prod-EventTracker-ExecutionRolePolicy"
        name             = "AccountDeleteMonitor-Prod-EventTracker-ExecutionRolePolicy"
      ~ tags             = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
            "costCenter"     = "Pocket"
          - "env_code"       = "prod" -> null
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDeleteMonitor"
        }
      ~ tags_all         = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.eventtracker_sqs-policy_32E8FFAA will be updated in-place
  ~ resource "aws_iam_policy" "eventtracker_sqs-policy_32E8FFAA" {
        id               = "arn:aws:iam::996905175585:policy/AccountDeleteMonitor-Prod-EventTracker-LambdaSQSPolicy"
        name             = "AccountDeleteMonitor-Prod-EventTracker-LambdaSQSPolicy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:SendMessage",
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                          - "sqs:ChangeMessageVisibility",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:us-east-1:996905175585:AccountDeleteMonitor-Prod-EventTracker-Queue"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags             = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
            "costCenter"     = "Pocket"
          - "env_code"       = "prod" -> null
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDeleteMonitor"
        }
      ~ tags_all         = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_iam_role.eventtracker_lambda-code-deploy_code-deploy-role_761181E3 will be updated in-place
  ~ resource "aws_iam_role" "eventtracker_lambda-code-deploy_code-deploy-role_761181E3" {
        id                    = "AccountDeleteMonitor-Prod-EventTracker-CodeDeployRole"
        name                  = "AccountDeleteMonitor-Prod-EventTracker-CodeDeployRole"
      ~ tags                  = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
        }
      ~ tags_all              = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.eventtracker_lambda_execution-role_6AC27719 will be updated in-place
  ~ resource "aws_iam_role" "eventtracker_lambda_execution-role_6AC27719" {
        id                    = "AccountDeleteMonitor-Prod-EventTracker-ExecutionRole"
        name                  = "AccountDeleteMonitor-Prod-EventTracker-ExecutionRole"
      ~ tags                  = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
            "costCenter"     = "Pocket"
          - "env_code"       = "prod" -> null
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDeleteMonitor"
        }
      ~ tags_all              = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.eventtracker_lambda_2D56166D will be updated in-place
  ~ resource "aws_lambda_function" "eventtracker_lambda_2D56166D" {
        id                             = "AccountDeleteMonitor-Prod-EventTracker-Function"
      ~ tags                           = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
            "costCenter"     = "Pocket"
          - "env_code"       = "prod" -> null
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDeleteMonitor"
        }
      ~ tags_all                       = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_s3_bucket.eventtracker_lambda_code-bucket_E2F7C311 will be updated in-place
  ~ resource "aws_s3_bucket" "eventtracker_lambda_code-bucket_E2F7C311" {
        id                          = "pocket-accountdeletemonitor-prod-eventtracker"
      ~ tags                        = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
            "costCenter"     = "Pocket"
          - "env_code"       = "prod" -> null
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDeleteMonitor"
        }
      ~ tags_all                    = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_sns_topic.pagerduty_alarm-critical-topic_F1534579 will be updated in-place
  ~ resource "aws_sns_topic" "pagerduty_alarm-critical-topic_F1534579" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:AccountDeleteMonitor-Prod-Infrastructure-Alarm-Critical"
        name                                     = "AccountDeleteMonitor-Prod-Infrastructure-Alarm-Critical"
      ~ tags                                     = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
        }
      ~ tags_all                                 = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)
    }

  # aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3 will be updated in-place
  ~ resource "aws_sns_topic" "pagerduty_alarm-non-critical-topic_53C1A3B3" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:AccountDeleteMonitor-Prod-Infrastructure-Alarm-Non-Critical"
        name                                     = "AccountDeleteMonitor-Prod-Infrastructure-Alarm-Non-Critical"
      ~ tags                                     = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
        }
      ~ tags_all                                 = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)
    }

  # aws_sqs_queue.eventtracker_lambda_sqs_queue_3DFE90FE will be updated in-place
  ~ resource "aws_sqs_queue" "eventtracker_lambda_sqs_queue_3DFE90FE" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDeleteMonitor-Prod-EventTracker-Queue"
        name                              = "AccountDeleteMonitor-Prod-EventTracker-Queue"
      ~ tags                              = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
            "costCenter"     = "Pocket"
          - "env_code"       = "prod" -> null
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDeleteMonitor"
        }
      ~ tags_all                          = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.eventtracker_lambda_sqs_queue_redrive_sqs_queue_D13D2A55 will be updated in-place
  ~ resource "aws_sqs_queue" "eventtracker_lambda_sqs_queue_redrive_sqs_queue_D13D2A55" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDeleteMonitor-Prod-EventTracker-Queue-Deadletter"
        name                              = "AccountDeleteMonitor-Prod-EventTracker-Queue-Deadletter"
      ~ tags                              = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
            "costCenter"     = "Pocket"
          - "env_code"       = "prod" -> null
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDeleteMonitor"
        }
      ~ tags_all                          = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.sns-topic-dql will be updated in-place
  ~ resource "aws_sqs_queue" "sns-topic-dql" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDeleteMonitor-Prod-SNS-Topics-DLQ"
        name                              = "AccountDeleteMonitor-Prod-SNS-Topics-DLQ"
      ~ tags                              = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
            "costCenter"     = "Pocket"
          - "env_code"       = "prod" -> null
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDeleteMonitor"
        }
      ~ tags_all                          = {
          - "app_code"       = "pocket" -> null
          - "component_code" = "pocket-accountdeletemonitor" -> null
          - "env_code"       = "prod" -> null
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.adm-sns-dlq-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "adm-sns-dlq-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDeleteMonitor-Prod-SNS-Topics-DLQ"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnLike = {
                              - "aws:SourceArn" = [
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserMerge-Topic",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "sns.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sqs:us-east-1:996905175585:AccountDeleteMonitor-Prod-SNS-Topics-DLQ"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue_policy.adm-sns-sqs-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "adm-sns-sqs-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDeleteMonitor-Prod-EventTracker-Queue"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnLike = {
                              - "aws:SourceArn" = [
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserMerge-Topic",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "sns.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sqs:us-east-1:996905175585:AccountDeleteMonitor-Prod-EventTracker-Queue"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 18 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"37238301-22bf-4bbc-a535-750e1454bede","JobName":"account-delete-monitor_infrastructure_plan_prod","PRNumber":575,"Program":"tfcmt","SHA1":"35b874cb1c4719dfbb6b2d64f8ef9da60fe07f14","Target":"account-delete-monitor-cdk","Vars":{}} -->